[["List of Fugitive Economic Offenders in India: Vijay Mallya, Nirav Modi, \nothers | Mint", "https://www.livemint.com/news/india/list-of-fugitive-economic-offenders-in-india-vijay-mallya-nirav-modi-others-11657531740954.html", "People involved in money laundering, forging official stamps or money,  dishonouring checks and activities that mislead creditors fall under...", "Jul 11, 2022", "Sign in\n\ne-paper\n\nSubscribe\n\nSunday, 8 October 2023\n\nStocks\n\nMutual Funds\n\nNews\n\nHome\n\nLatest\n\nNews\n\nMarkets\n\nPremium\n\nMoney\n\nMutual Fund\n\nIndustry\n\nCompanies\n\nTechnology\n\nWeb Stories\n\nOpinion\n\nVideos\n\nAll\n\nCompanies\n\nTechnology\n\nMarkets\n\nMoney\n\nMutual Funds\n\nInsurance\n\nAuto\n\nIndustry\n\nPersonal Finance\n\nHello User\n\nSign in\n\nSign Out\n\nMy Account\n\nMy Account\n\nSubscribe\n\nMy Watchlist\n\nNewsletters\n\nNotifications\n\nMy Reads\n\nFor You\n\nView Less -\n\nView More +\n\nData Insights\n\nMarket Dashboard\n\nBullion      Gold   Silver\n\nFuel      Petrol   Diesel\n\nCommodities      Gold   GoldM   Aluminum   Menthaoil   Silver   SilverMIC   GoldPetal   Natural Gas   Copper   Zinc   SilverM   CrudeOil   GoldGinuea   Lead\n\nCryptoCurrencies\n\nView Less -\n\nView More +\n\nTop Sections\n\nNews      India News   World News   Elections 2023\n\nCompanies      IPO News   Start-ups   Company Results   Top Company Leader\n\nMoney      Personal Finance   Q&A   Opinion\n\nMarkets      Stock Markets   Commodity News   Mark To Market   IPO News   Live Blog\n\nIndustry      Banking News   Infotech News   Infrastructure   Agriculture   Manufacturing   Energy News   Retail News   Auto News   Sports\n\nOpinion      Views   Columns\n\nTechnology      Gadgets   Tech Reviews   App News\n\nPolitics\n\nEducation\n\nLounge\n\nView Less -\n\nView More +\n\nPremium Offerings\n\ne-paper\n\nWSJ\n\nEconomist\n\nMint Premium\n\nView Less -\n\nView More +\n\nTools and Calculators\n\nIFSC Code Finder\n\nIncome Tax Calculator\n\nSIP Calculator\n\nEMI Calculator\n\nHome Loan EMI Calculator\n\nCar Loan EMI\n\nNPS Calculator\n\nView Less -\n\nView More +\n\nMultiMedia Collections\n\nVideos\n\nWebStories\n\nPhoto Gallery\n\nPodcasts\n\nView Less -\n\nView More +\n\nMore From Mint\n\nMint Genie\n\nExplore Mint\n\nAbout Us\n\nPrint Subscription\n\nMint Authors\n\nTerms of Use\n\nDisclaimer\n\nMint Code\n\nCode of ethics\n\nCookie Policy\n\nPrivacy Policy\n\nSubscriber - Terms of Use\n\nSITEMAP\n\nContact Us\n\nMint Apps\n\nView Less -\n\nView More +\n\nCopyright &copy HT Digital Streams Limited \n\nGainers & Losers\n\nFri Oct 06 2023 15:51:11\n\nBajaj Finserve share price\n    \n    1,632.85.86%\n\nBajaj Finance share price\n    \n    8,167.54.05%\n\nTitan Company share price\n    \n    3,311.152.98%\n\nIndusind Bank share price\n    \n    1,434.652.38%\n\nITC share price\n    \n    442.21.42%\n\nHindustan Unilever share price\n    2,498.75-0.93%\n\nAsian Paints share price\n    3,193.65-0.37%\n\nBharti Airtel share price\n    926.05-0.29%\n\nAxis Bank share price\n    1,000.95-0.26%\n\nLarsen & Toubro share price\n    3,093.45-0.13%\n\nActive Stocks\n\nFri Oct 06 2023 15:55:46\n\nTata Steel share price \n\t    125.9  0.52%\n\nNTPC share price \n\t    235.75  0.79%\n\nPower Grid Corporation Of India share price \n\t    196.85  0.18%\n\nState Bank Of India share price \n\t    594.1  0.31%\n\nHDFC Bank share price \n\t    1,534.15  -0.11%\n\nBusiness News/\n\nNews /\n\nIndia/  List of Fugitive Economic Offenders in India: Vijay Mallya, Nirav Modi, others\n\nBack\n\nShare Via\n\nList of Fugitive Economic Offenders in India: Vijay Mallya, Nirav Modi, others\n\n3 min read  \n11 Jul 2022, 03:23 PM IST\n\nJoin us\n\nEdited By Sounak Mukhopadhyay\n\nPeople involved in money laundering, forging official stamps or money, dishonouring checks and activities that mislead creditors fall under the FEO legislation.\n\nPremium\r\nFugitive businessmen Vijay Mallya, Nirav Modi and Mehul Choksi. (Twitter)\n\nRead Full Story\n\nOn July 11, the Supreme Court handed down a four-month term in a contempt case against fugitive tycoon Vijay Mallya, who was charged in a bank loan default case involving his disbanded Kingfisher Airlines and a debt of over  ₹9,000 crore. Mallya was also given a  ₹2,000 fine by a court panel presided over by Justice U U Lalit. \"Adequate punishment is a must. Mallya didn't show any remorse,\" the top court bench said.\n\nMallya is considered a Fugitive Economic Offender (FEO):a person for whom an arrest warrant has been issued in connection with the commission of an offence enumerated in the Act that has a minimum financial impact of Rs. 100 crore is called an FEO.\n\nMoney laundering, forging official stamps or money, dishonouring checks and activities that mislead creditors are some of the offences that are included in the FEO legislation. Vijay Mallya, however, is not the only FEO in India. Here are other such people who fall into the same category.\n\nHajra Iqbal Memon\n\nIn 2021, Hajra Memon, the widow of the deceased gangster Iqbal Mirchi, and her sons Asif and Junaid were designated as an FEO. Mirchi was regarded as wanted terrorist Dawood Ibrahim's right-hand man. Memons has been charged with using money gained illegally to purchase real estate all across Mumbai. In the case, the ED had attached assets worth  ₹800 crore up until 2021. The family resides abroad, but it is mostly unknown where they are.\n\nLalit Modi\n\nThe Indian Premier League (IPL) was first made popular by Lalit Modi. When Lalit was the IPL Commissioner, the scam occurred. Then Multi Screen Media Limited (MSM) (now Sony Pictures Networks India) approached the BCCI following the media rights auction. It announced that World Sports Group (WSG) Mauritius has been given the media rights to broadcast the IPL. However, between BCCI and WSG, there was no such arrangement. Lalit Modi alone negotiated these contracts and, as per reports, he might have received  ₹125 crore. He is now in the UK looking for refuge.\n\nAlso Read: 5 things to know about fugitive economic offenders\n\nNitin J. Sandesara and others\n\nOwner of Gujarat-based Sterling Biotech, Nitin J. Sandesara has been designated a FEO due to his default on the  ₹5,000 crore loaned to Andhra Bank. The swindle ended up costing R 81,000 crore. In this case, Hitesh Narendrabhai Patel, Dipti Sandesara, and Chetan Sandesara are also charged.\n\nNirav Modi\n\nJeweller and fashion designer Nirav Modi is charged with defrauding Punjab National Bank (PNB) of  ₹14,000 crore in one of the largest banking frauds in Indian history. Modi imported pearls into India using phoney letters of undertaking (LoUs). Later, it came to light that Modi's LoUs had also been provided by PNB's Brady House branch in Fort, Mumbai, in violation of the law. He is currently seeking political asylum in the UK.\n\nNeeshal Modi\n\nNirav Modi's brother is Neeshal Modi, married to Mukesh and Anil Ambani's niece, Isheta Salgaocar. He is also charged with participating in the PNB Scam. In 2018, the CBI requested that the Ministry of Home Affairs extradite him from his country of citizenship, Belgium. He is said to be the beneficiary owner of numerous LoUs and fictitious businesses. He wrote to the Enforcement Directorate (ED) in 2020 to distance himself from Mehul Choksi and Nirav Modi.\n\nMehul Choksi\n\nNirav Modi's uncle Mehul Choksi was a part of the PNB scam. He was the proprietor of the retail jewellery company Gitanjali Group. In addition to corruption and criminal conspiracy, he is accused of money laundering and criminal breach of trust. Since 2018, he has resided in Antigua and Barbuda, where he is now a citizen. He vanished from the nation in 2021 and then reappeare"], ["A look at some of the biggest bank fraud cases that hit India in a decade", "https://www.deccanherald.com/business/a-look-at-some-of-the-biggest-bank-fraud-cases-that-hit-india-in-a-decade-1174934.html", "The Central Bureau of Investigation (CBI) this week arrested Chanda Kochhar  and her husband, Deepak Kochhar in relation to the Rs...", "Dec 25, 2022", "Home\n\nIndia\n\nWorld Cup 2023\n\nOpinion\n\nKarnataka\n\nWorld\n\nBusiness\n\nSports\n\nEntertainment\n\nVideo\n\nNews Shots\n\nExplainers\n\nBengaluru\n\nScience\n\nTrending\n\nBrandspot\n\nPhotos\n\nDH Specials\n\nE-PAPER\n\nE-PAPER\n\nHome\n\nIndia\n\nWorld Cup 2023\n\nOpinion\n\nKarnataka\n\nWorld\n\nBusiness\n\nSports\n\nEntertainment\n\nVideo\n\nNews Shots\n\nExplainers\n\nBengaluru\n\nScience\n\nTrending\n\nBrandspot\n\nPhotos\n\nDH Specials\n\nHome\n\nNews Shots\n\nTrending\n\nMenu\n\nADVERTISEMENT\n\nADVERTISEMENT\n\nHome\n\nbusiness\n\nA look at some of the biggest bank fraud cases that hit India in a decade\n\nVijay Mallya fraud case, PNB scam and ABG Shipyard fraud case are some of the biggest scams that hit India in past few years\n\nDH Web Desk\n\nLast Updated 25 December 2022, 16:11 IST\n\nFollow Us\n\nThe Central Bureau of Investigation (CBI) this week arrested Chanda Kochhar and her husband, Deepak Kochhar in relation to the Rs 3,000-crore Videocon Group loan scam. There were several other people also booked in the case under the relevant sections of IPC related to criminal conspiracy and provisions of the Prevention of Corruption Act.\n\nHere we take a look at the top 10 bank fraud cases that hit India in the past 10 years.\n\nVijay Mallya Fraud case\n\nThe King of Good Times, as Mallya was known as, is one of the biggest offenders when it comes to bank fraud. The businessman's now bankrupt. The Kingfisher Airlines owes more than Rs 10,000 crore to several banks, wih SBI, PNB and IDBI all loaning him money. Mallya fled India in early 2016. Out of the original loan of Rs 6,900 crore to Kingfisher, SBI had lent Mallya Rs 1,600 crore.\n\nAlso Read | CBI files FIR against Corporate Power Ltd in Rs 4K-cr bank fraud case\n\nThe Punjab National Bank had Rs 800 crores, IDBI had Rs 650 crores, and the Bank of Baroda had Rs 550 crore. The banks had approached a special Prevention of Money Laundering Act (PMLA) court which allowed them to sell certain real estate properties and securities belonging to Mallya to recover loans turned bad. The Indian government is trying to get Mallya to be extradited from the UK to India to face criminal proceedings.\n\nPunjab National Bank scam\n\nThe Punjab National Bank scam was touted as India's biggest at Rs 11,400 crore and the main accused were jeweller Nirav Modi, Mehul Choksi, Nishant Modi, Ami Modi and others, including some PNB staff. The scam involved 'letters of undertaking’ fraudulently issued by a junior official at the bank to get short-term loans from overseas bank branches to pay sellers and the transactions never registered with the bank, where officials also did not notice the fraud.\n\nAlso Read | CBI files three fresh FIRs against Mehul Choksi in Rs 6,700 crore fraud case\n\nA CBI probe exposed the scam where the accused defrauded 30 Indian banks' foreign branches. Modi, Choksi fled India a couple days before the scam was made public. Modi, who was in prison in London had recently appealed against his extradition which has been denied.\n\nWinsome Diamonds bank fraud\n\nBusinessman Jatin Mehta’s Winsome Diamonds fraudulently acquired letters of undertaking from Indian banks and the fraud was caught for the first time in 2014. Mehta and his wife Sonia and their sons Vipul and SurajIt fled India and have left a loan default amounting to almost Rs 7,000 crore. Over 10 cases have been filed against Mehta.\n\nABG Shipyard fraud case\n\nThe CBI charged ABG Shipyard Limited, its former chairman and managing director Rishi Kamlesh Agarwal, Santhanam Muthaswamy, Ashwini Kumar, Ravi Vimal Nevetia, Sushil Kumar Agarwal, and another firm, ABG International Pvt Ltd for embezzling Rs 22,842 crore from SBI and 27 other lenders. The loan account was named as a non-performing asset in July 2016, and fraud was detected in 2019.\n\nKanishk Gold bank fraud\n\nKanishk Gold Pvt Ltd was charged by CBI for allegedly cheating 14 banks led by SBI out of Rs 824 crore. The owners have been accused of taking huge loans for business and were detrimnetal to the banks' rights and interests, the lawsuit said, according to media reports. ED in Chennai froze properties worth Rs 48 crore of Kanishk Gold Pvt Ltd udner the PMLA. SBI has said security to cover the loss due to the fraud is around Rs 156 crore.\n\nAndhra Bank fraud\n\nGujarat-based pharma company Sterling Biotech Limited was involved in the Andhra bank fraud case as 4 directors of the company were named defaulters in the Rs 8,100-crore bank scam. Nitin Sandesara, Chetan Sandesara, Dipti Sandesara and Hiteshkumar Narendrabhai Patel, were designated fugitives in the scam. The company has been accused of acquiring over Rs 5,000 crore in loans from a consortium led by Andhra Bank, which has since become non-performing assets.\n\nRotomac Pen Scam\n\nRotomac Global Private Limited of Kanpur, its promoter Vikram Kothari, and other directors were charged by the CBI of allegedly defrauding lenders for ₹ 750.54 crore. The company has a total outstanding of Rs 2,919 crore against a consortium of seven banks led by Bank of India.  The bank had been providing the company with loans from 2002 and in 2015, the account was labelled as a non-performing asset (NPA). Kothari passed away early 2022 after an accident at home. He was arrested in connection with the case in 2018 and spent 2 yeas in jail, after which he was granted bail on health grounds.\n\nVideocon Case fraud\n\nFIR was filed against former ICICI Bank CEO Chanda Kochhar, her husband Deepak Kochhar, and Videocon group MD Venugopal Dhoot for alleged irregularities in loans the bank to the group back in 2012. The case pertains to the time when Kochhar was the CEO of ICICI and had loaned Rs 3,250 crore to Dhoot’s Videocon Group. A whistleblower, who owned shares in both the bank and the group, claimed that the loan to Videocon was influenced by Kochhar in exchange for a deal in NuPower Renewables and Supreme Energy, a clean-energy firm managed by Kochhar's husband.\n\nADVERTISEMENT\n\n(Published 25 December 2022, 10:44 IST)\n\nBusiness News\n\nSBI\n\nNirav Modi\n\nMehul Choksi\n\nBank fraud\n\nVijay Mallya\n\nChanda Kochhar\n\nKingfisher Airlines\n\nPunjab National Bank\n\nRotomac\n\nFollow us on\n\nFollow\n\nADVERTISEMENT\n\nADVERTISEMENT\n\nIndia\n\nSouth\n\nNorth\n\nWest\n\nEast & North East\n\nOpinion\n\nEditorial\n\nSpeak Out\n\nCartoon\n\nKarnataka\n\nBengaluru\n\nSports\n\nCricket\n\nFootball\n\nTennis\n\nF1 Racing\n\nEntertainment\n\nMovie Reviews\n\nPhotos\n\nSpecials\n\nDH on Sunday\n\nDH on Saturday\n\nExplainers\n\nExplained | The Palestinian and Israeli conflict\n\nExplained | Mahadev betting app: The case which has rocked lives of many Bollywood stars\n\nExplained | Fall of the zombies? Why corporate failures could surge in 2024\n\nExplained | 6 reasons why global temperatures are spiking right now\n\nWhat's Brewing\n\nSC to hear on Oct 9 ex-Delhi minister Satyendar Jain's bail plea in money laundering case\n\nTamil Nadu Assembly to convene on October 9 amid Cauvery issue\n\nSri Lanka to host IORA Council of Ministers meeting in Colombo; Jaishankar set to attend\n\nIndia's first large private gold mine to begin full-scale production by end of next year: DGML MD"], ["Canara Bank fraud: CBI files fresh case against fugitive Mehul Choksi. Read \nhere | Mint", "https://www.livemint.com/news/india/canara-bank-fraud-cbi-files-fresh-case-against-fugitive-mehul-choksi-read-here-11657803760090.html", "The Central Bureau of Investigation has filed fresh FIR against fugitive  diamantaire Mehul Choksi for cheating Canara Bank-led consortium to...", "Jul 14, 2022", "Sign in\n\ne-paper\n\nSubscribe\n\nSunday, 8 October 2023\n\nStocks\n\nMutual Funds\n\nNews\n\nHome\n\nLatest\n\nNews\n\nMarkets\n\nPremium\n\nMoney\n\nMutual Fund\n\nIndustry\n\nCompanies\n\nTechnology\n\nWeb Stories\n\nOpinion\n\nVideos\n\nAll\n\nCompanies\n\nTechnology\n\nMarkets\n\nMoney\n\nMutual Funds\n\nInsurance\n\nAuto\n\nIndustry\n\nPersonal Finance\n\nHello User\n\nSign in\n\nSign Out\n\nMy Account\n\nMy Account\n\nSubscribe\n\nMy Watchlist\n\nNewsletters\n\nNotifications\n\nMy Reads\n\nFor You\n\nView Less -\n\nView More +\n\nData Insights\n\nMarket Dashboard\n\nBullion      Gold   Silver\n\nFuel      Petrol   Diesel\n\nCommodities      Gold   GoldM   Aluminum   Menthaoil   Silver   SilverMIC   GoldPetal   Natural Gas   Copper   Zinc   SilverM   CrudeOil   GoldGinuea   Lead\n\nCryptoCurrencies\n\nView Less -\n\nView More +\n\nTop Sections\n\nNews      India News   World News   Elections 2023\n\nCompanies      IPO News   Start-ups   Company Results   Top Company Leader\n\nMoney      Personal Finance   Q&A   Opinion\n\nMarkets      Stock Markets   Commodity News   Mark To Market   IPO News   Live Blog\n\nIndustry      Banking News   Infotech News   Infrastructure   Agriculture   Manufacturing   Energy News   Retail News   Auto News   Sports\n\nOpinion      Views   Columns\n\nTechnology      Gadgets   Tech Reviews   App News\n\nPolitics\n\nEducation\n\nLounge\n\nView Less -\n\nView More +\n\nPremium Offerings\n\ne-paper\n\nWSJ\n\nEconomist\n\nMint Premium\n\nView Less -\n\nView More +\n\nTools and Calculators\n\nIFSC Code Finder\n\nIncome Tax Calculator\n\nSIP Calculator\n\nEMI Calculator\n\nHome Loan EMI Calculator\n\nCar Loan EMI\n\nNPS Calculator\n\nView Less -\n\nView More +\n\nMultiMedia Collections\n\nVideos\n\nWebStories\n\nPhoto Gallery\n\nPodcasts\n\nView Less -\n\nView More +\n\nMore From Mint\n\nMint Genie\n\nExplore Mint\n\nAbout Us\n\nPrint Subscription\n\nMint Authors\n\nTerms of Use\n\nDisclaimer\n\nMint Code\n\nCode of ethics\n\nCookie Policy\n\nPrivacy Policy\n\nSubscriber - Terms of Use\n\nSITEMAP\n\nContact Us\n\nMint Apps\n\nView Less -\n\nView More +\n\nCopyright &copy HT Digital Streams Limited \n\nGainers & Losers\n\nFri Oct 06 2023 15:51:11\n\nBajaj Finserve share price\n    \n    1,632.85.86%\n\nBajaj Finance share price\n    \n    8,167.54.05%\n\nTitan Company share price\n    \n    3,311.152.98%\n\nIndusind Bank share price\n    \n    1,434.652.38%\n\nITC share price\n    \n    442.21.42%\n\nHindustan Unilever share price\n    2,498.75-0.93%\n\nAsian Paints share price\n    3,193.65-0.37%\n\nBharti Airtel share price\n    926.05-0.29%\n\nAxis Bank share price\n    1,000.95-0.26%\n\nLarsen & Toubro share price\n    3,093.45-0.13%\n\nActive Stocks\n\nFri Oct 06 2023 15:55:46\n\nTata Steel share price \n\t    125.9  0.52%\n\nNTPC share price \n\t    235.75  0.79%\n\nPower Grid Corporation Of India share price \n\t    196.85  0.18%\n\nState Bank Of India share price \n\t    594.1  0.31%\n\nHDFC Bank share price \n\t    1,534.15  -0.11%\n\nBusiness News/\n\nNews /\n\nIndia/  Canara Bank fraud: CBI files fresh case against fugitive Mehul Choksi. Read here\n\nBack\n\nShare Via\n\nCanara Bank fraud: CBI files fresh case against fugitive Mehul Choksi. Read here\n\n1 min read  \n14 Jul 2022, 06:47 PM IST\n\nJoin us\n\nLivemint\n\nThe Central Bureau of Investigation has filed fresh FIR against fugitive diamantaire Mehul Choksi for cheating Canara Bank-led consortium to the tune of  ₹55.27 crore\n\nPremium\r\nDiamantaire Mehul Choksi (MINT_PRINT)\n\nRead Full Story\n\nThe Central Bureau of Investigation (CBI) has filed fresh FIR against fugitive diamantaire Mehul Choksi for cheating Canara Bank-led consortium to the tune of  ₹55.27 Cr, officials clarified on Thursday.\n\nNirav Modi's uncle Mehul Choksi was a part of the PNB scam. He was the proprietor of the retail jewellery company Gitanjali Group. In addition to corruption and criminal conspiracy, he is accused of money laundering and criminal breach of trust.\n\nWhat is the Canara Bank Fraud\n\nThe Canara Bank and the Bank of Maharashtra had sanctioned  ₹30 crore and  ₹25 crore respectively as working capital facility under a consortium agreement to Bezel Jewellery.\n\nIt is alleged that though the loan was granted for the manufacturing and sale of gold and diamond-studded jewellery, the company did not route any of the business transactions through the account to hide diversion of funds.\n\nThe company did not repay the loan, causing a loss of  ₹55.27 crore to the consortium, the agency has alleged.\n\nCBI has also booked Bezel Jewellery and its whole-time directors, including Choksi, Chetna Jhaveri, Dinesh Bhatia and Milind Limaye.\n\nWhat is the PNB scam?\n\nThe Choksi-Modi duo is suspected of defrauding Punjab National Bank (PNB) of more than  ₹14,000 crore through the Punjab National Bank (PNB) scam, which Indian authorities want them for. Choksi has been arrested for criminal conspiracy, cheating, breach of trust, dishonesty, corruption, money laundering, and delivery of property.\n\nOn 16 April this year, it was reported that the properties of Choksi have been confiscated by the Income Tax department. The I-T sleuths have also seized Choksi's nine acres of agricultural land in Nashik.\n\nThe Punjab National Bank scam relates to the fraudulent letter of undertaking issued by the bank. Jeweller and designer Nirav Modi is the key accused in the case. Both Choksi and Modi fled India after the PNB scam came to light in early 2018. Choksi, promoter and managing director of Gitanjali Gems is the maternal uncle of Nirav Modi. The stock market regulatory body has banned Choksi from the capital markets for one year and has also levied a fine.\n\nWhere is Choksi now?\n\nSince 2018, he has resided in Antigua and Barbuda, where he is now a citizen. He vanished from the nation in 2021 and then reappeared in Dominica. He was turned away from the nation.\n\n\"Exciting news! Mint is now on WhatsApp Channels 🚀 Subscribe today by clicking the link and stay updated with the latest financial insights!\" Click here!\n\nRelated Premium Stories\n\nWhat the RBI’s monetary policy report says about inflation drivers, in charts\n\nRestaurants look to score big on World Cup cheer\n\nMint Primer: How prices have moved since last MPC meeting\n\nMint Explainer: Why single-screens and blockbusters are made for each other\n\nGovt notifies bankruptcy code changes to make aircraft recovery easier\n\nMint Explainer: Why does India want big cuts in Canada’s diplomatic strength?\n\nIndia needs more women workers to be a $5 tn economy: World Bank India chief\n\nCapex dips in Q2, may stay muted for a while\n\nMint Primer: How an Andhra scheme can save pension reforms\n\nCoal stock comfortable, commercial mines to produce 145 mt in FY24: Coal secy\n\nExplore Premium\n\n\n                Catch all the \n\nBusiness News,\n\nMarket News,\n\nBreaking News Events and\n\nLatest News Updates on Live Mint.\n        Download The\n\nMint News App to get Daily Market Updates.\n\nMore\n\nLess\n\nUpdated: 14 Jul 2022, 06:54 PM IST\n\nOPEN IN APP\n\nNext Story\n\nRecommended For You\n\nFeedback\n\nSelect your Category\n\nYour Message\n\nConnect with us:\n\n\n\n\n\n\n\n\n\ntrending stories\n\nSensex Today\n\nIndia vs Australia Live\n\nAsian Games 2023 LIVE\n\nStocks to Watch\n\nGlobal markets update\n\nGerman-American Day\n\nWorld Smile Day 2023\n"]]